/******************************************************************************
 * ZQ_ECG_filter_parm.c
 * 
 * Copyright 2012 Wuhan Zoncare Electronics Co.,Ltd.
 * 
 * Description:  
 * - This file implements the follow functions:
 * - 
 * 
 * Author: gdyshi 
 * Date:  11:48am, 15.May.2014
 * Modification History
 * --------------------
 * Date              Modifier    Problem N.O.                 Description
 * --------------------
 ******************************************************************************/

#include "gdyshi_filter_internal.h"

const filt_temp_t h_pass_005_a[] = 
{
    1,-0.999686634915953
};
const filt_temp_t h_pass_005_b[] = 
{
    1,-1
};
const filt_type_a_par_t h_pass_005_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    h_pass_005_b,   ARRAY_SIZE(h_pass_005_b),   0,                0,                    h_pass_005_a,   ARRAY_SIZE(h_pass_005_a),
};
const ZQ_ECG_filt_arg_t h_pass_005 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_HPASS_005,         FILT_INTERNAL_TYPE_HPASS,   do_filt_type_a,     1,              1,              (void *)&h_pass_005_par,
};

const filt_b_ele_t h_pass_03_a[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     1920*1920},
    {2,     -1920*1920*2},
    {3,     1920*1920},
};
const filt_b_ele_t h_pass_03_b[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     -1},
    {1920,     1920*1920},
    {1921,     2-1920*1920*2},
    {1922,     1920*1920},
    {3841,     -1},
};
const filt_type_b_par_t h_pass_03_par = 
{
/*  滤波参数类型    分子参数总个数  分子参数中有效数据个数      分子参数        分母参数总个数  分母参数中有效数据个数          分母参数      */
    FILT_TYPE_B,    3841,           ARRAY_SIZE(h_pass_03_b),   h_pass_03_b,   3,              ARRAY_SIZE(h_pass_03_a),       h_pass_03_a, 
};
const ZQ_ECG_filt_arg_t h_pass_03 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_HPASS_03,         FILT_INTERNAL_TYPE_HPASS,   do_filt_type_b,     1,              1,              (void *)&h_pass_03_par,
};
const filt_b_ele_t h_pass_06_a[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     960*960},
    {2,     -960*960*2},
    {3,     960*960},
};
const filt_b_ele_t h_pass_06_b[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     -1},
    {960,     960*960},
    {961,     2-960*960*2},
    {962,     960*960},
    {1921,     -1},
};
const filt_type_b_par_t h_pass_06_par = 
{
/*  滤波参数类型    分子参数总个数  分子参数中有效数据个数      分子参数        分母参数总个数  分母参数中有效数据个数          分母参数      */
    FILT_TYPE_B,    1921,           ARRAY_SIZE(h_pass_06_b),   h_pass_06_b,   3,              ARRAY_SIZE(h_pass_06_a),       h_pass_06_a, 
};
const ZQ_ECG_filt_arg_t h_pass_06 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_HPASS_06,         FILT_INTERNAL_TYPE_HPASS,   do_filt_type_b,     1,              1,              (void *)&h_pass_06_par,
};
/* 滤波参数定义 */
const filt_temp_t l_pass_150_a[] = 
{
    1
};
const filt_temp_t l_pass_150_b[] = 
{
    0.250000000000000,1.88541258511537,3.27082517023073,1.88541258511536,0.250000000000000
};
const filt_type_a_par_t l_pass_150_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    l_pass_150_b,   ARRAY_SIZE(l_pass_150_b),   0,                0,                    l_pass_150_a,   ARRAY_SIZE(l_pass_150_a),
};


/* 滤波器定义 */
const ZQ_ECG_filt_arg_t l_pass_150 = 
{
/*  滤波器名称              滤波器类型                  滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_LPASS_150,         FILT_INTERNAL_TYPE_LPASS,   do_filt_type_a,     1,              0.132596972128890,              (void *)&l_pass_150_par,
};
const filt_temp_t l_pass_100_a[] = 
{
    1
};
const filt_temp_t l_pass_100_b[] = 
{
    0.0156250000000000,0.196725833715806,0.867855002294837,1.95088750573709,2.52826667431612,1.95088750573709,0.867855002294836,0.196725833715806,0.0156250000000000
};
const filt_type_a_par_t l_pass_100_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    l_pass_100_b,   ARRAY_SIZE(l_pass_100_b),   0,                0,                    l_pass_100_a,   ARRAY_SIZE(l_pass_100_a),
};
const ZQ_ECG_filt_arg_t l_pass_100 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_LPASS_100,         FILT_INTERNAL_TYPE_LPASS,   do_filt_type_a,     1,               0.116408291663753,    (void *)&l_pass_100_par,
};
const filt_temp_t l_pass_75_a[] = 
{
    1
};
const filt_temp_t l_pass_75_b[] = 
{
    0.000244140625000000,0.00761205471032256,0.0725458283988707,0.365676860881289,1.16708367689596,2.56484208160967,4.05487037745047,4.71322605233804,4.05487037745047,2.56484208160967,1.16708367689596,0.365676860881289,0.0725458283988706,0.00761205471032255,0.000244140624999999
};
const filt_type_a_par_t l_pass_75_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    l_pass_75_b,   ARRAY_SIZE(l_pass_75_b),   0,                0,                    l_pass_75_a,   ARRAY_SIZE(l_pass_75_a),
};
const ZQ_ECG_filt_arg_t l_pass_75 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_LPASS_75,         FILT_INTERNAL_TYPE_LPASS,   do_filt_type_a,     1,              0.0472166357611497,              (void *)&l_pass_75_par,
};
const filt_temp_t l_pass_45_a[] = 
{
    1
};
const filt_temp_t l_pass_45_b[] = 
{
    3.63797880709171e-12,1.22720148602888e-10,1.97126132966186e-09,1.99155310264771e-08,1.40142488129044e-07,7.10910702199958e-07,2.52016758802614e-06,4.88409988828074e-06,-7.95164880033393e-06,-0.000120186043636148,-0.000632731943897968,-0.00236757399814930,-0.00710969471471117,-0.0179511260464238,-0.0390291527941656,-0.0741172466957311,-0.124075305443983,-0.184242745312810,-0.243706404286794,-0.287942339997496,-0.304354048996057,-0.287942339997496,-0.243706404286794,-0.184242745312810,-0.124075305443983,-0.0741172466957311,-0.0390291527941656,-0.0179511260464238,-0.00710969471471117,-0.00236757399814930,-0.000632731943897968,-0.000120186043636148,-7.95164880033393e-06,4.88409988828074e-06,2.52016758802614e-06,7.10910702199958e-07,1.40142488129044e-07,1.99155310264771e-08,1.97126132966186e-09,1.22720148602888e-10,3.63797880709171e-12
};
const filt_type_a_par_t l_pass_45_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    l_pass_45_b,   ARRAY_SIZE(l_pass_45_b),   0,                0,                    l_pass_45_a,   ARRAY_SIZE(l_pass_45_a),
};
const ZQ_ECG_filt_arg_t l_pass_45 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_LPASS_45,         FILT_INTERNAL_TYPE_LPASS,   do_filt_type_a,     1,               -0.441122806925490,              (void *)&l_pass_45_par,
};

const filt_temp_t l_pass_35_a[] = 
{
    1, 0, 0
};
const filt_temp_t l_pass_35_b[] = 
{
    3.46944695195361e-18,1.59212732608157e-16,3.30158420343243e-15,3.78033730023768e-14,1.81296532804351e-13,-1.82132327320073e-12,-5.06193874142827e-11,-6.41509674649057e-10,-5.84222542174626e-09,-4.25457283074002e-08,-2.59730296140260e-07,-1.36541888368946e-06,-6.29146616284779e-06,-2.57308389120421e-05,-9.42979312756412e-05,-0.000311984307344003,-0.000937454251741314,-0.00257093247338225,
    -0.00646147410685571,-0.0149336350070442,-0.0318312868248663,-0.0627289242149914,-0.114528807810361,-0.194072387961349,-0.305676245312228,-0.448071024921112,-0.611870533465565,-0.779022663460603,-0.925305484689899,-1.02577485625961,-1.06160281314068,-1.02577485625961,-0.925305484689899,-0.779022663460603,-0.611870533465565,-0.448071024921112,-0.305676245312228,-0.194072387961349,-0.114528807810361,-0.0627289242149914,-0.0318312868248663,-0.0149336350070442,-0.00646147410685571,-0.00257093247338225,-0.000937454251741314,-0.000311984307344003,-9.42979312756412e-05,-2.57308389120421e-05,-6.29146616284779e-06,-1.36541888368946e-06,-2.59730296140260e-07,-4.25457283074002e-08,-5.84222542174626e-09,-6.41509674649058e-10,-5.06193874142827e-11,-1.82132327320073e-12,1.81296532804351e-13,3.78033730023768e-14,3.30158420343243e-15,1.59212732608157e-16,3.46944695195361e-18
};
const filt_type_a_par_t l_pass_35_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    l_pass_35_b,   ARRAY_SIZE(l_pass_35_b),   0,                0,                    l_pass_35_a,   ARRAY_SIZE(l_pass_35_a),
};
const ZQ_ECG_filt_arg_t l_pass_35 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_LPASS_35,         FILT_INTERNAL_TYPE_LPASS,   do_filt_type_a,     1,  -0.0989114381573364,                         (void *)&l_pass_35_par,
};
const filt_temp_t l_pass_25_a[] = 
{
    1
};
const filt_temp_t l_pass_25_b[] = 
{
    2.93873587705572e-39,3.68828214233860e-37,2.29507467568392e-35,9.44011995536117e-34,2.88720418019185e-32,7.00297779825972e-31,1.40306453516942e-29,2.38808885497694e-28,3.52458503693082e-27,4.58183436902396e-26,5.31113263268250e-25,5.54448200746516e-24,5.25541561700982e-23,4.55397647519017e-22,3.62848178449009e-21,2.67154487836103e-20,1.82542866206306e-19,1.16186014875095e-18,6.91116057373141e-18,3.85308235385575e-17,2.01851679911976e-16,9.95871392308414e-16,4.63648985175244e-15,2.04060412549118e-14,8.50331836409237e-14,3.35946462509269e-13,1.25983640786207e-12,4.48901888589052e-12,1.52100869445503e-11,4.90364870954186e-11,1.50482081030727e-10,4.39632684781285e-10,1.22254681155140e-09,3.23425680873621e-09,8.13121053505540e-09,1.93921870553039e-08,4.37450022165450e-08,9.29024916917493e-08,1.84308384646373e-07,3.36899043941696e-07,5.52171866394208e-07,7.60173560230426e-07,6.92309562937394e-07,-3.82980658595266e-07,-4.15778885659295e-06,-1.41425208128871e-05,-3.70244767717376e-05,-8.46389240535477e-05,
    -0.000176562093335833,-0.000343133601707608,-0.000628409855650279,-0.00109217835449935,-0.00180982201185048,-0.00286866506279612,-0.00435963478334037,-0.00636377431912357,-0.00893435862120634,-0.0120769233863728,-0.0157310313452540,-0.0197585429961771,-0.0239430144297554,-0.0280033180298175,-0.0316217795267054,-0.0344836233207359,-0.0363212554426390,-0.0369549158361004,-0.0363212554426390,-0.0344836233207359,-0.0316217795267054,-0.0280033180298175,-0.0239430144297554,-0.0197585429961771,-0.0157310313452540,-0.0120769233863728,-0.00893435862120634,-0.00636377431912356,-0.00435963478334037,-0.00286866506279611,-0.00180982201185048,-0.00109217835449935,-0.000628409855650279,-0.000343133601707608,-0.000176562093335833,
    -8.46389240535476e-05,-3.70244767717376e-05,-1.41425208128871e-05,-4.15778885659295e-06,-3.82980658595264e-07,6.92309562937394e-07,7.60173560230426e-07,5.52171866394208e-07,3.36899043941696e-07,1.84308384646373e-07,9.29024916917492e-08,4.37450022165450e-08,1.93921870553039e-08,8.13121053505540e-09,3.23425680873621e-09,1.22254681155140e-09,4.39632684781285e-10,1.50482081030727e-10,4.90364870954186e-11,1.52100869445503e-11,4.48901888589052e-12,1.25983640786207e-12,3.35946462509269e-13,8.50331836409237e-14,2.04060412549118e-14,4.63648985175244e-15,9.95871392308414e-16,2.01851679911976e-16,3.85308235385575e-17,6.91116057373141e-18,1.16186014875095e-18,1.82542866206306e-19,2.67154487836103e-20,3.62848178449009e-21,4.55397647519017e-22,5.25541561700982e-23,5.54448200746516e-24,5.31113263268250e-25,4.58183436902396e-26,3.52458503693082e-27,2.38808885497694e-28,1.40306453516942e-29,7.00297779825971e-31,2.88720418019185e-32,9.44011995536118e-34,2.29507467568392e-35,3.68828214233860e-37,2.93873587705572e-39
};
const filt_type_a_par_t l_pass_25_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    l_pass_25_b,   ARRAY_SIZE(l_pass_25_b),   96,                0,                    l_pass_25_a,   ARRAY_SIZE(l_pass_25_a),
};
const ZQ_ECG_filt_arg_t l_pass_25 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_LPASS_25,         FILT_INTERNAL_TYPE_LPASS,   do_filt_type_a,     1,               -2.02321733634629,              (void *)&l_pass_25_par,
};

const filt_temp_t trap_50_a[] = 
{
     1,-1.89498601279696,0.992506207915900
};
const filt_temp_t trap_50_b[] = 
{
    0.996253103957950,-1.89498601279696,0.996253103957950
};
const filt_type_a_par_t trap_50_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    trap_50_b,   ARRAY_SIZE(trap_50_b),   0,                0,                    trap_50_a,   ARRAY_SIZE(trap_50_a),
};

const ZQ_ECG_filt_arg_t trap_50 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_TRAP_50,         FILT_INTERNAL_TYPE_TRAP,   do_filt_type_a,     1,              1,              (void *)&trap_50_par,
};
const filt_temp_t trap_60_a[] = 
{
    1,-1.85258542010657,0.992506207915900
};
const filt_temp_t trap_60_b[] = 
{
    0.996253103957950,-1.85258542010657,0.996253103957950
};
const filt_type_a_par_t trap_60_par = 
{
/*  滤波参数类型      分子参数        分子参数个数              分子参数中0的个数 分子参数中1的个数     分母参数        分母参数个数 */
    FILT_TYPE_A,    trap_60_b,   ARRAY_SIZE(trap_60_b),   0,                0,                    trap_60_a,   ARRAY_SIZE(trap_60_a),
};
const ZQ_ECG_filt_arg_t trap_60 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_TRAP_60,         FILT_INTERNAL_TYPE_TRAP,   do_filt_type_a,     1,              1,              (void *)&trap_60_par,
};
const filt_b_ele_t comb_50_03_a[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     96*96},
    {21,     -96*96*2},
    {41,     96*96},
};
const filt_b_ele_t comb_50_03_b[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     -1},
    {1901,     96*96},
    {1921,     2-96*96*2},
    {1941,     96*96},
    {3841,     -1},
};
const filt_type_b_par_t comb_50_03_par = 
{
/*  滤波参数类型    分子参数总个数  分子参数中有效数据个数      分子参数        分母参数总个数  分母参数中有效数据个数          分母参数      */
    FILT_TYPE_B,    3841,           ARRAY_SIZE(comb_50_03_b),   comb_50_03_b,   41,              ARRAY_SIZE(comb_50_03_a),       comb_50_03_a, 
};
const ZQ_ECG_filt_arg_t comb_50_03 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_COMB_50_03,         FILT_INTERNAL_TYPE_TRAP,   do_filt_type_b,     1,              1,              (void *)&comb_50_03_par,
};
const filt_b_ele_t comb_50_06_a[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     48*48},
    {21,     -2*48*48},
    {41,     48*48},
};
const filt_b_ele_t comb_50_06_b[] = 
{
/* 序号，此序号为matlab序号(从1起始)     参数值 */
    {1,     -1},
    {941,     48*48},
    {961,     2-2*48*48},
    {981,     48*48},
    {1921,     -1},
};
const filt_type_b_par_t comb_50_06_par = 
{
/*  滤波参数类型    分子参数总个数  分子参数中有效数据个数      分子参数        分母参数总个数  分母参数中有效数据个数          分母参数      */
    FILT_TYPE_B,    1921,           ARRAY_SIZE(comb_50_06_b),   comb_50_06_b,   41,              ARRAY_SIZE(comb_50_06_a),       comb_50_06_a, 
};
const ZQ_ECG_filt_arg_t comb_50_06 = 
{
/*  滤波器名称              滤波器类型      滤波函数            参数增益(分子)  参数增益(分母)  参数列表 */
    NAME_FILT_COMB_50_06,         FILT_INTERNAL_TYPE_TRAP,   do_filt_type_b,     1,              1,              (void *)&comb_50_06_par,
};
